'''Дано трехзначное число. Найдите сумму его цифр.

Формат входных данных
Вводится трехзначное число.

Формат выходных данных
Одно число — сумма цифр.'''

x = input()


s = int(x[0]) + int(x[1]) + int(x[2])

print(s)
